//Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
let i = 0;

while (i < 10) {
  i++;
  console.log(i);
}

//Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

for (let i = 0; i < 21; i++) {
  if (i % 2 === 0) {
    continue;
  }
  console.log(i);
}

// Вивести в консоль таблицю множення числа 7 за допомогою циклу for.

for (let i = 1; i <= 10; i++) {
  console.log(`7 * ${i} = ${7 * i}`);
}

//Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
let n = Number(prompt("Введіть число n"));
let j = 0;

while (true) {
  if (j >= n) break;
  console.log(j);
  j++;
}

//За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

let k = 1;

while (k <= 20) {
  if (k % 3 === 0) {
    k++;
    continue;
  }
  console.log(k);
  k++;
}
